Revit 2027 API
ConnectionInputPointInfo.RestrictionType Property
 A type of input point restriction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RestrictionType { get; set; }
Public Property RestrictionType As String
	Get
	Set
public:
property String^ RestrictionType {
	String^ get ();
	void set (String^ value);
}
member RestrictionType : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace